//Εισαγωγή της τάξης URL που βρίσκεται στο πακέτο java.net
import java.net.URL ;

/**
 * Τάξη που επιτρέπει την αναφορά της τοποθεσίας που
 * βρίσκεται η τάξη σε στατικά μέλη της εφαρμογής.
 * (Συγκεκριμένα χρησιμοποιείται από τις τάξεις με όνομα
 * ???Message για την εύρεση του URL των εικόνων που θα
 * εμφανίζουν στο παράθυρο που μυνήματος δημιουργούν).
 * @author Πέτρος Κυλαδίτης
 * @verion 1.0.0
 * @serial 040729
 * @since  040729
 */
final class ResourceReferenceFromStaticMembers extends Object{
	/**
	 * Μέθοδος που επιστρέφει το URL του αντικειμένου που ορίζεται.
	 * @param title Η σχετική διαδρομή και το όνομα του αντικειμένου.
	 * @return Το απόλλυτο URL του αντικειμένου βάση της διαδρομής
	 *		απ' όπου βρίσκεται η τάξη.
	 */
	public URL getResource(String who){
		return this.getClass().getResource(who) ;
	}
}